Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz1025dab288.h
#define _SBT16WR0_GROUP3_POSITION                0x00000003
#define _SBT16WR0_GROUP3_MASK                    0x00000008
#define _SBT16WR0_GROUP3_LENGTH                  0x00000001

#define _SBT16REG1_SIZE_POSITION                 0x00000003
#define _SBT16REG1_SIZE_MASK                     0x000000F8
#define _SBT16REG1_SIZE_LENGTH                   0x00000005

#define _SBT16REG1_PRI_POSITION                  0x00000009
#define _SBT16REG1_PRI_MASK                      0x00000200
#define _SBT16REG1_PRI_LENGTH                    0x00000001

#define _SBT16REG1_BASE_POSITION                 0x0000000A
#define _SBT16REG1_BASE_MASK                     0xFFFFFC00
#define _SBT16REG1_BASE_LENGTH                   0x00000016

#define _SBT16RD1_GROUP0_POSITION                0x00000000
#define _SBT16RD1_GROUP0_MASK                    0x00000001
#define _SBT16RD1_GROUP0_LENGTH                  0x00000001

#define _SBT16RD1_GROUP1_POSITION                0x00000001
#define _SBT16RD1_GROUP1_MASK                    0x00000002
#define _SBT16RD1_GROUP1_LENGTH                  0x00000001

#define _SBT16RD1_GROUP2_POSITION                0x00000002
#define _SBT16RD1_GROUP2_MASK                    0x00000004
#define _SBT16RD1_GROUP2_LENGTH                  0x00000001

#define _SBT16RD1_GROUP3_POSITION                0x00000003
#define _SBT16RD1_GROUP3_MASK                    0x00000008
#define _SBT16RD1_GROUP3_LENGTH                  0x00000001

#define _SBT16WR1_GROUP0_POSITION                0x00000000
#define _SBT16WR1_GROUP0_MASK                    0x00000001
#define _SBT16WR1_GROUP0_LENGTH                  0x00000001

#define _SBT16WR1_GROUP1_POSITION                0x00000001
#define _SBT16WR1_GROUP1_MASK                    0x00000002
#define _SBT16WR1_GROUP1_LENGTH                  0x00000001

#define _SBT16WR1_GROUP2_POSITION                0x00000002
#define _SBT16WR1_GROUP2_MASK                    0x00000004
#define _SBT16WR1_GROUP2_LENGTH                  0x00000001

#define _SBT16WR1_GROUP3_POSITION                0x00000003
#define _SBT16WR1_GROUP3_MASK                    0x00000008
#define _SBT16WR1_GROUP3_LENGTH                  0x00000001

#define _SBT16REG2_SIZE_POSITION                 0x00000003
#define _SBT16REG2_SIZE_MASK                     0x000000F8
#define _SBT16REG2_SIZE_LENGTH                   0x00000005

#define _SBT16REG2_PRI_POSITION                  0x00000009
#define _SBT16REG2_PRI_MASK                      0x00000200
#define _SBT16REG2_PRI_LENGTH                    0x00000001

#define _SBT16REG2_BASE_POSITION                 0x0000000A
#define _SBT16REG2_BASE_MASK                     0xFFFFFC00
#define _SBT16REG2_BASE_LENGTH                   0x00000016

#define _SBT16RD2_GROUP0_POSITION                0x00000000
#define _SBT16RD2_GROUP0_MASK                    0x00000001
#define _SBT16RD2_GROUP0_LENGTH                  0x00000001

#define _SBT16RD2_GROUP1_POSITION                0x00000001
#define _SBT16RD2_GROUP1_MASK                    0x00000002
#define _SBT16RD2_GROUP1_LENGTH                  0x00000001

#define _SBT16RD2_GROUP2_POSITION                0x00000002
#define _SBT16RD2_GROUP2_MASK                    0x00000004
#define _SBT16RD2_GROUP2_LENGTH                  0x00000001

#define _SBT16RD2_GROUP3_POSITION                0x00000003
#define _SBT16RD2_GROUP3_MASK                    0x00000008
#define _SBT16RD2_GROUP3_LENGTH                  0x00000001

#define _SBT16WR2_GROUP0_POSITION                0x00000000
#define _SBT16WR2_GROUP0_MASK                    0x00000001
#define _SBT16WR2_GROUP0_LENGTH                  0x00000001

#define _SBT16WR2_GROUP1_POSITION                0x00000001
#define _SBT16WR2_GROUP1_MASK                    0x00000002
#define _SBT16WR2_GROUP1_LENGTH                  0x00000001

#define _SBT16WR2_GROUP2_POSITION                0x00000002
#define _SBT16WR2_GROUP2_MASK                    0x00000004
#define _SBT16WR2_GROUP2_LENGTH                  0x00000001

#define _SBT16WR2_GROUP3_POSITION                0x00000003
#define _SBT16WR2_GROUP3_MASK                    0x00000008
#define _SBT16WR2_GROUP3_LENGTH                  0x00000001

#define _SBT16REG3_SIZE_POSITION                 0x00000003
#define _SBT16REG3_SIZE_MASK                     0x000000F8
#define _SBT16REG3_SIZE_LENGTH                   0x00000005

#define _SBT16REG3_PRI_POSITION                  0x00000009
#define _SBT16REG3_PRI_MASK                      0x00000200
#define _SBT16REG3_PRI_LENGTH                    0x00000001

#define _SBT16REG3_BASE_POSITION                 0x0000000A
#define _SBT16REG3_BASE_MASK                     0xFFFFFC00
#define _SBT16REG3_BASE_LENGTH                   0x00000016

#define _SBT16RD3_GROUP0_POSITION                0x00000000
#define _SBT16RD3_GROUP0_MASK                    0x00000001
#define _SBT16RD3_GROUP0_LENGTH                  0x00000001

#define _SBT16RD3_GROUP1_POSITION                0x00000001
#define _SBT16RD3_GROUP1_MASK                    0x00000002
#define _SBT16RD3_GROUP1_LENGTH                  0x00000001

#define _SBT16RD3_GROUP2_POSITION                0x00000002
#define _SBT16RD3_GROUP2_MASK                    0x00000004
#define _SBT16RD3_GROUP2_LENGTH                  0x00000001

#define _SBT16RD3_GROUP3_POSITION                0x00000003
#define _SBT16RD3_GROUP3_MASK                    0x00000008
#define _SBT16RD3_GROUP3_LENGTH                  0x00000001

#define _SBT16WR3_GROUP0_POSITION                0x00000000
#define _SBT16WR3_GROUP0_MASK                    0x00000001
#define _SBT16WR3_GROUP0_LENGTH                  0x00000001

#define _SBT16WR3_GROUP1_POSITION                0x00000001
#define _SBT16WR3_GROUP1_MASK                    0x00000002
#define _SBT16WR3_GROUP1_LENGTH                  0x00000001

#define _SBT16WR3_GROUP2_POSITION                0x00000002
#define _SBT16WR3_GROUP2_MASK                    0x00000004
#define _SBT16WR3_GROUP2_LENGTH                  0x00000001

#define _SBT16WR3_GROUP3_POSITION                0x00000003
#define _SBT16WR3_GROUP3_MASK                    0x00000008
#define _SBT16WR3_GROUP3_LENGTH                  0x00000001

#define _SBT16REG4_SIZE_POSITION                 0x00000003
#define _SBT16REG4_SIZE_MASK                     0x000000F8
#define _SBT16REG4_SIZE_LENGTH                   0x00000005

#define _SBT16REG4_PRI_POSITION                  0x00000009
#define _SBT16REG4_PRI_MASK                      0x00000200
#define _SBT16REG4_PRI_LENGTH                    0x00000001

